{
    "photo": "pycontw-2020/assets/keynotes/wenyu-su.png",
    "speaker": {
        "en": {
            "name": "Wen Yu Su",
            "bio": "Mr. Wen-Yu Su is a current Professor of Computer Science at National Cheng Kung University (NCKU), Taiwan. He holds a PhD and a Master’s degree in Electrical Engineering at New York University Tandon School of Engineering, and a Bachelor’s degree at NCKU. His prior experience includes being a postdoctoral researcher at Stanford University, an engineer in the Department of Information and Communication Technology at Industrial Technology Research Institute of Taiwan, and an Associate Professor at the Department of Computer Science and Information Engineering of Chung Hua University. Prior to 2011, Prof. Su focused on Digital Audio Signal Processing, Biomedical Signal Analysis, Image/Video Processor Design, Multi-Core Processor Design, Embedded Memory Management, and OpenESL. After 2012, he turned to focus on Audio Processing, Machine Learning, and Virtual Orchestra. Over the years, he has been working on improving students' practical ability.\nRecognizing the increasing importance of information technology and computer programming as well as reduced students' practical and inquiry skills, Prof. Su established the Program the World Association (PTWA) in 2013. Starting from Dongshih Township in Chiayi County, he led a team to teach disadvantaged students in rural elementary and secondary schools how to program in 2014. As of 2020, he has assisted more than 70 schools and non-profit organizations spanning 12 counties and cities, which benefits over 2,500 students and teachers. Over the years, courses have become more diverse. The teaching plan includes Train the Trainer, Seeing Hometown, Programming and Maker Courses, Self-propelled Car Contests, and Coding-X Programming for High School Students. To promote the progress of higher education, PTWA held more than 70 events each year and proactively participated in NCKU’s admissions for disadvantaged students, computer-based exams for special selection, online courses, and exam systems, etc. Although having been using donations to offer educational activities for many years is difficult, it is very gratifying to see children from disadvantaged families growing and developing.\nArtificial Intelligence is becoming increasingly important nowadays, but most courses lack hands-on practice to attract students’ interests. Thus, in 2018, Prof. Su invested in the development of courses and the online platform, ML Game, that use games to beat monsters, modeled after prestigious foreign schools. In 2020, the platform was completed, and courses were successfully launched in the Department of Computer Science and Information Engineering at NCKU. Many schools have approached the platform for promoting courses until now. The platform is also expected to cooperate with Microsoft Taiwan to promote courses in 2020 or 2021 and hold a national Machine Learning competition.\nIn addition to general academic works, Prof. Su also published books including \"Being Significant Other to Children\" and \"Teacher is a belated parent of children\" that record several years of counseling work for children from disadvantaged families in remote areas."
        },
        "zh": {
            "name": "蘇文鈺",
            "bio": "蘇文鈺現為成功大學資訊工程系教授，國立交通大學士，紐約大學坦登學院碩博士，史丹佛大學博士後研究，工研院電通所工程師，中華大學資訊工程系副教授。2011 年之前致力於神經網路訊號處理，生理訊號分析，視音訊處理器設計，多核心處理器設計，內嵌記憶體管理與電子系統層工具 OpenESL，2012 年之後轉為致力於音樂音訊處理，機器學習與虛擬管弦樂團。多年來，以提高學生實務實作能力為要旨。\n2013 年，有鑒於資訊科技與程式設計日益重要，學生的實作探究能力降低，成立 Program The World Association (PTWA)（社團法人中華民國愛自造者學習協會），2014 年從嘉義東石偏鄉開始，帶領團隊教導偏鄉弱勢中小學學生以程式設計。截至 2020 年，摩頂放踵，足跡遍及 12 個縣市，輔導的學校與非營利組織超過 70 個，受惠的國教學生與教師超過 2500 人。多年來，課程漸趨多元，教學計劃包含 Train The Trainer，看見家鄉，程式與自造巡迴課程，自走車競賽，Coding-X 偏鄉高中職生程式設計，樂塾，特教科技課程。每年舉辦活動超過 70 場。並積極參與成功大學不分系，弱勢招生，上機考特殊選才，線上課程與考試系統等等促進高教進步的工作．多年來，PTWA 以募捐所得進行免費公益教學，雖感艱辛，但是見到弱勢家庭孩子得以成長，頗為欣慰。\n2018 年，有鑒於人工智慧的日益重要，但是多數課程缺乏實務操作經驗，吸引學生投入之不足，仿照國外名校，投入開發以遊戲打怪過關的方式的課程與線上平台 - ML Game，2020 年，平台完成，並在成功大學資訊系順利開課，目前已有多所學校接洽推廣，並預計在 2020/2021 與台灣微軟合作推廣課程，並舉辦全國性機器學習比賽。\n除了一般學術著作外，另出版「做孩子的重要他人」與「老師是孩子遲來的父母」，紀錄多年在偏鄉與弱勢家庭的孩子的輔導工作。"
        }
    },
    "session": {
        "en": {
            "title": "A New Era of Teaching - Starting from Online Machine Learning Platform And Entry Level Courses",
            "description": "The world’s response to COVID-19 has resulted in the most rapid transformation of work styles and teaching methods. Many world-renowned companies like Google and Facebook had made announcements that WFH (Work From Home) will be extended until at least 2021.\nIn February 2020, National Cheng Kung University announced that courses with more than a hundred students enrolled should be moved into online courses. Many professors have to prepare online learning materials in a short time frame. Most of them made teaching videos and used moodle in the school as support for student learning.\nMy class, The Basics of Game-based Machine Learning, is an undergraduate elective course. I prepared to move it online for students because of the pandemic. I heard that online classes are not effective in educating students, so my graduate students and I, along with an online learning expert, think together on how to get through this semester of this class without too much effect on students’ learnings.\nBesides pre-recorded teaching videos, we also use several online applications and social media, build collaborative FAQs for all questions, and establish an online competition platform that allows students to upload programming tasks for tests.  The competition for all uploaded programming tasks will be significant evaluation factors and be broadcast live on the platform.\nIn my keynote section, I will give details on how the class is conducted, the use of the platform, and the future prospects of it. As a teacher, adapting trends and changes of students and the world in my way of teachings and thinking is a necessary step to maintain the competitive strength of Taiwan."
        },
        "zh": {
            "title": "新世代的教學思維 - 從機器學習線上平台與入門課程談起",
            "description": "隨著新冠病毒，全世界的工作型態與教學方式劇烈地改變，許多知名的世界級公司如 Google 與 Facebook 都陸續宣布 WFH(Work From Home) 會至少持續到明年為止。\n國立成功大學在 2020/2 也宣布超過 100 人的課程要改用線上教學，許多教授緊急準備線上教學，但是多數教授除了錄製教學影片之外往往只能搭配學校的 moodle 來輔助學生的學習。\n我開設的「遊戲式機器學習入門」為大學部選修課，也在上述要求下開始準備線上教學。因為風聞線上教學的效果不佳，所以我的研究生與我，加上一位預先申請的業界專家，共同思考如何度過這學期，同時希望教學成效不要打太多折。\n除了預錄教學影片外，我們使用了數個線上應用軟體與社群，並且共筆 FAQ 盡可能回答各式問題外，還架設了一個線上競賽平台，讓學生在考試日可以上傳程式後以競賽得分作為主要評量方式，並直播比賽過程。\n除說明這門課的上課方式之外，也會介紹此平台的使用方式與未來的發展，同時也深深感到，身為老師要為了世界與新世代學生的改變而變更自己的教學思維與方式，以維持台灣的競爭力。"
        }
    },
    "social": {
        "link": "",
        "twitter": "",
        "github": ""
    },
    "slido": ""
}
